Revit 2026 API

# IFCBuiltInCategoryKey Properties

---

The IFCBuiltInCategoryKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IFCBuiltInCategoryKey Class

Autodesk.Revit.DB Namespace